In [6]:
import numpy as np
import pandas as pd

In [7]:
data = pd.read_csv('/workspaces/ML-Assignment5/layoffs_and_stocks.csv', parse_dates=['DATE'])
data.head()

,DATE,sector,layoffs,ticker,Date,price,log_return
0,2000-12-01,Accommodation and Food Services,133,XLY,2000-12-01,19.431828,NaN
1,2001-01-01,Accommodation and Food Services,191,XLY,2001-01-01,21.745836,0.119083
2,2001-02-01,Accommodation and Food Services,93,XLY,2001-02-01,20.193089,-0.071404
3,2001-03-01,Accommodation and Food Services,207,XLY,2001-03-01,19.858204,-0.016584
4,2001-04-01,Accommodation and Food Services,257,XLY,2001-04-01,20.821493,0.048508

In [8]:
data['sector'].unique()

array(['Accommodation and Food Services',
       'Arts, Entertainment, and Recreation', 'Construction',
       'Education and Health Services', 'Finance and Insurance',
       'Financial Activities', 'Government',
       'Health Care and Social Assistance', 'Information',
       'Leisure and Hospitality', 'Manufacturing', 'Mining and Logging',
       'Professional and Business Services',
       'Real Estate and Rental and Leasing', 'Retail Trade',
       'State and Local', 'Trade, Transportation, and Utilities',
       'Transportation, Warehousing, and Utilities'], dtype=object)

In [10]:
data.sort_values(by=['sector', 'DATE'], inplace=True)
data.head(10)

,DATE,sector,layoffs,ticker,Date,price,log_return
0,2000-12-01,Accommodation and Food Services,133,XLY,2000-12-01,19.431828,NaN
1,2001-01-01,Accommodation and Food Services,191,XLY,2001-01-01,21.745836,0.119083
2,2001-02-01,Accommodation and Food Services,93,XLY,2001-02-01,20.193089,-0.071404
3,2001-03-01,Accommodation and Food Services,207,XLY,2001-03-01,19.858204,-0.016584
4,2001-04-01,Accommodation and Food Services,257,XLY,2001-04-01,20.821493,0.048508
5,2001-05-01,Accommodation and Food Services,125,XLY,2001-05-01,21.317245,0.023810
6,2001-06-01,Accommodation and Food Services,186,XLY,2001-06-01,21.103689,-0.010018
7,2001-07-01,Accommodation and Food Services,207,XLY,2001-07-01,22.089520,0.046714
8,2001-08-01,Accommodation and Food Services,166,XLY,2001-08-01,20.155727,-0.087543
9,2001-09-01,Accommodation and Food Services,269,XLY,2001-09-01,17.556969,-0.128934

In [5]:
data.head(10)

,DATE,sector,layoffs,ticker,Date,price,log_return,moving_averages
0,2000-12-01,Accommodation and Food Services,133,XLY,2000-12-01,19.431828,NaN,NaN
4155,2000-12-01,State and Local,86,VTI,2000-12-01,NaN,NaN,NaN
3878,2000-12-01,Retail Trade,536,XRT,2000-12-01,NaN,NaN,NaN
4709,2000-12-01,"Transportation, Warehousing, and Utilities",30,XLY,2000-12-01,19.431828,NaN,NaN
554,2000-12-01,Construction,384,XLI,2000-12-01,20.342838,NaN,NaN
3601,2000-12-01,Real Estate and Rental and Leasing,5,IYR,2000-12-01,14.967026,NaN,NaN
831,2000-12-01,Education and Health Services,106,XLV,2000-12-01,19.083679,NaN,NaN
277,2000-12-01,"Arts, Entertainment, and Recreation",66,XLY,2000-12-01,19.431828,NaN,NaN
3324,2000-12-01,Professional and Business Services,504,XLI,2000-12-01,20.342838,NaN,NaN
3047,2000-12-01,Mining and Logging,22,XLE,2000-12-01,18.098047,NaN,NaN